Revit 2026 API

# BooleanOperationsType Enumeration

---

An enumerated type listing boolean types that are supported for boolean operation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum BooleanOperationsType
```
```vb
Public Enumeration BooleanOperationsType
```
```cpp
public enum class BooleanOperationsType
```
```fsharp
type BooleanOperationsType
```

| Member name | Value | Description |
| --- | --- | --- |
| Difference | 1 | Difference. |
| Intersect | 2 | Intersect. |
| Union | 0 | Union. |

#### Reference

Autodesk.Revit.DB Namespace